In [2]:
import pandas as pd
import numpy as np
import re

In [3]:
df = pd.read_csv("naukri_jobs_codealpha.csv")

In [4]:
df

,Job Title,Company,Location,Experience,Salary,Link
0,Data Science Intern,Neozeno Talent Llp,Remote,NaN,"15,000/month",https://www.naukri.com/job-listings-data-scien...
1,Data Analyst Intern,Voylla,Jaipur,0-1 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
2,Data Analytics Intern,Reliance Games,Pune,0-1 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
3,Data Science Intern,Cyfotok,Coimbatore,NaN,Unpaid,https://www.naukri.com/job-listings-data-scien...
4,Data Analyst,Also Energy,"Noida, Gurugram, Delhi / NCR",0-2 Yrs,4-5 Lacs PA,https://www.naukri.com/job-listings-data-analy...
...,...,...,...,...,...,...
7124,Data engineer,Leading Client,Hyderabad,4-6 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-engin...
7125,Data Scientist,ADQ Services,Hyderabad,1-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
7126,Data Scientist,Syren Cloud Inc,Hyderabad,3-6 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
7127,Data Scientist,Veniso Solutions,Hyderabad,2-7 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
7128,Data Analyst,Apptad,"Prayagraj, Varanasi, Ghaziabad, Kanpur, Luckno...",0-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...

In [16]:
df.shape

(7129, 6)

In [17]:
df.columns

Index(['Job Title', 'Company', 'Location', 'Experience', 'Salary', 'Link'], dtype='object')

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2375 entries, 1 to 2388
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Job Title       2375 non-null   object
 1   Company         2375 non-null   object
 2   Location        2375 non-null   object
 3   Experience      2375 non-null   object
 4   Salary          2375 non-null   object
 5   Link            2375 non-null   object
 6   min_exp         2375 non-null   int64
 7   max_exp         2375 non-null   int64
 8   avg_exp         2375 non-null   float64
 9   salary_numeric  214 non-null    float64
dtypes: float64(2), int64(2), object(6)
memory usage: 204.1+ KB

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
df

,Job Title,Company,Location,Experience,Salary,Link
0,Data Science Intern,Neozeno Talent Llp,Remote,NaN,"15,000/month",https://www.naukri.com/job-listings-data-scien...
1,Data Analyst Intern,Voylla,Jaipur,0-1 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
2,Data Analytics Intern,Reliance Games,Pune,0-1 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
3,Data Science Intern,Cyfotok,Coimbatore,NaN,Unpaid,https://www.naukri.com/job-listings-data-scien...
4,Data Analyst,Also Energy,"Noida, Gurugram, Delhi / NCR",0-2 Yrs,4-5 Lacs PA,https://www.naukri.com/job-listings-data-analy...
...,...,...,...,...,...,...
2384,Data engineer,Leading Client,Hyderabad,4-6 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-engin...
2385,Data Scientist,ADQ Services,Hyderabad,1-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
2386,Data Scientist,Syren Cloud Inc,Hyderabad,3-6 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
2387,Data Scientist,Veniso Solutions,Hyderabad,2-7 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
2388,Data Analyst,Apptad,"Prayagraj, Varanasi, Ghaziabad, Kanpur, Luckno...",0-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...

In [18]:
df.isnull().sum()

Job Title      0
Company        0
Location       2
Experience    11
Salary         0
Link           0
dtype: int64

In [7]:
df.dropna(inplace = True)

In [8]:
df

,Job Title,Company,Location,Experience,Salary,Link
1,Data Analyst Intern,Voylla,Jaipur,0-1 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
2,Data Analytics Intern,Reliance Games,Pune,0-1 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
4,Data Analyst,Also Energy,"Noida, Gurugram, Delhi / NCR",0-2 Yrs,4-5 Lacs PA,https://www.naukri.com/job-listings-data-analy...
5,Data Analyst / Web Researcher,Myvirtualdesks,Pune,0-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
6,Data Analyst,Digital Solution Tech,Remote,0-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...
...,...,...,...,...,...,...
2384,Data engineer,Leading Client,Hyderabad,4-6 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-engin...
2385,Data Scientist,ADQ Services,Hyderabad,1-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
2386,Data Scientist,Syren Cloud Inc,Hyderabad,3-6 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
2387,Data Scientist,Veniso Solutions,Hyderabad,2-7 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-scien...
2388,Data Analyst,Apptad,"Prayagraj, Varanasi, Ghaziabad, Kanpur, Luckno...",0-3 Yrs,Not Disclosed,https://www.naukri.com/job-listings-data-analy...

In [9]:
# Question 1: What are the most common job titles?
df['Job Title'].value_counts().head(10)

Job Title
Data Analyst                                                 545
Data Engineer                                                426
Data Scientist                                               391
MIS Executive                                                 71
Analyst                                                       42
Data Scientist-Artificial Intelligence                        35
Mis Executive                                                 25
Senior Data Scientist - Machine Learning                      18
Data Scientist - Machine Learning/Artificial Intelligence     17
Data Governance Purview Analyst                               17
Name: count, dtype: int64

In [10]:
# Question 2: Which companies post the most jobs?
df['Company'].value_counts().head(10)

Company
Accenture                    215
Leading Client               180
Wipro                         56
Amgen Inc                     40
IBM                           37
Soul Ai                       32
ti Steps                      25
Diverse Lynx                  24
Fusion Plus Solutions Inc     20
Capgemini                     15
Name: count, dtype: int64

In [11]:
# 3: Where are most jobs located?
# Many jobs have multiple cities, so let's split and count all mentions
def extract_cities(location):
    if pd.isna(location):
        return []
    # Remove content in parentheses and split by comma
    cleaned = re.sub(r'\([^)]*\)', '', str(location))
    cities = [city.strip() for city in cleaned.split(',')]
    return [c for c in cities if c and 'Remote' not in c and 'Hybrid' not in c]

all_cities = df['Location'].apply(extract_cities).explode()
print("Top 10 Locations (counting all city mentions):")
print(all_cities.value_counts().head(10))

Top 10 Locations (counting all city mentions):
Location
Bengaluru    595
Hyderabad    388
Pune         311
Chennai      244
Mumbai       233
Gurugram     168
New Delhi    147
Kolkata       89
Noida         79
Ahmedabad     53
Name: count, dtype: int64

In [12]:
# 4:Remote & Hybrid count
remote_count = df['Location'].astype(str).str.contains('Remote', case=False).sum()
hybrid_count = df['Location'].astype(str).str.contains('Hybrid', case=False).sum()
print(f"\nRemote jobs: {remote_count} ({remote_count/len(df)*100:.1f}%)")
print(f"Hybrid jobs: {hybrid_count} ({hybrid_count/len(df)*100:.1f}%)")

Remote jobs: 128 (5.4%)
Hybrid jobs: 112 (4.7%)

In [15]:
# 5. Experience Analysis
def parse_exp_range(exp):
    if pd.isna(exp) or str(exp) in ['N/A']:
        return np.nan, np.nan
    nums = re.findall(r'\d+', str(exp))
    if len(nums) == 0:
        return np.nan, np.nan
    elif len(nums) == 1:
        return int(nums[0]), int(nums[0])
    else:
        return int(nums[0]), int(nums[1])

df[['min_exp', 'max_exp']] = df['Experience'].apply(
    lambda x: pd.Series(parse_exp_range(x))
)
df['avg_exp'] = (df['min_exp'] + df['max_exp']) / 2

print("\n=== Experience Statistics ===")
print(df[['min_exp', 'max_exp', 'avg_exp']].describe())

print("\nMost common experience ranges:")
print(df['Experience'].value_counts().head(10))

=== Experience Statistics ===
           min_exp      max_exp      avg_exp
count  2375.000000  2375.000000  2375.000000
mean      3.248000     6.567158     4.907579
std       2.382622     3.144179     2.687530
min       0.000000     0.000000     0.000000
25%       2.000000     4.000000     3.000000
50%       3.000000     6.000000     4.500000
75%       5.000000     8.000000     6.500000
max      20.000000    25.000000    22.500000

Most common experience ranges:
Experience
2-4 Yrs     245
3-8 Yrs     171
5-10 Yrs    127
3-5 Yrs     125
2-5 Yrs     122
1-3 Yrs     117
5-8 Yrs     103
1-4 Yrs      95
4-9 Yrs      88
3-7 Yrs      87
Name: count, dtype: int64

In [16]:
# 6. Salary Analysis
print("\n=== Salary Disclosure ===")
total_jobs = len(df)
disclosed = df['Salary'].notna() & ~df['Salary'].astype(str).str.contains('Not Disclosed|Unpaid', case=False)
disclosed_count = disclosed.sum()
print(f"Jobs with disclosed salary: {disclosed_count} ({disclosed_count/total_jobs*100:.1f}%)")

=== Salary Disclosure ===
Jobs with disclosed salary: 214 (9.0%)

In [17]:
# Parse salary to numeric (annual in rupees)
def parse_salary(sal):
    if pd.isna(sal) or 'Not Disclosed' in str(sal) or 'Unpaid' in str(sal):
        return np.nan
    s = str(sal).replace(',', '').upper()
    if '/MONTH' in s:
        num = re.search(r'(\d+\.?\d*)', s)
        return float(num.group(1)) * 12 * 100000 if num else np.nan
    nums = re.findall(r'\d+\.?\d*', s)
    if not nums:
        return np.nan
    vals = [float(n) for n in nums]
    if max(vals) > 100:  # likely in rupees
        return np.mean(vals)
    else:  # in lacs
        return np.mean(vals) * 100000

df['salary_numeric'] = df['Salary'].apply(parse_salary)

print("\nSalary Statistics (in ₹ per year):")
print(df['salary_numeric'].describe())

print(f"Median salary: ₹{df['salary_numeric'].median():,.0f}")
print(f"Average salary: ₹{df['salary_numeric'].mean():,.0f}")

Salary Statistics (in ₹ per year):
count    2.140000e+02
mean     1.087414e+06
std      8.637438e+05
min      2.500138e+04
25%      4.750000e+05
50%      8.000000e+05
75%      1.500000e+06
max      5.500000e+06
Name: salary_numeric, dtype: float64
Median salary: ₹800,000
Average salary: ₹1,087,414

In [18]:
# 7. Trends & Patterns
print("\n=== Key Trends & Patterns ===")
print("• Data Analyst, Data Engineer, and Data Scientist roles dominate the market.")
print("• Bengaluru, Hyderabad, and Pune are the top hiring hubs.")
print("• Over 90% of salaries are 'Not Disclosed' — common in Indian job postings.")
print("• Most roles require 2–8 years of experience (mid-level focus).")
print("• Large consultancies (Accenture, Leading Client) post the most openings.")
print("• Remote work is rare (~5%), hybrid slightly more but still low.")

=== Key Trends & Patterns ===
• Data Analyst, Data Engineer, and Data Scientist roles dominate the market.
• Bengaluru, Hyderabad, and Pune are the top hiring hubs.
• Over 90% of salaries are 'Not Disclosed' — common in Indian job postings.
• Most roles require 2–8 years of experience (mid-level focus).
• Large consultancies (Accenture, Leading Client) post the most openings.
• Remote work is rare (~5%), hybrid slightly more but still low.

In [19]:
# 8. Anomalies & Data Issues Detected

print("\n=== Data Quality Issues Identified ===")
print("• High number of duplicate rows (likely from web scraping).")
print("• Inconsistent salary formats (lacs, rupees, monthly, ranges).")
print("• Multi-city locations make simple counting tricky.")
print("• Many 'Leading Client' entries — anonymized recruiter postings.")
print("• Some experience listed as 'N/A' or missing.")

print("\nRecommendations for further cleaning:")
print("   - Standardize location to primary city")
print("   - Impute or flag missing experience")
print("   - Consider removing or grouping anonymized companies")

=== Data Quality Issues Identified ===
• High number of duplicate rows (likely from web scraping).
• Inconsistent salary formats (lacs, rupees, monthly, ranges).
• Multi-city locations make simple counting tricky.
• Many 'Leading Client' entries — anonymized recruiter postings.
• Some experience listed as 'N/A' or missing.

Recommendations for further cleaning:
   - Standardize location to primary city
   - Impute or flag missing experience
   - Consider removing or grouping anonymized companies

In [22]:
df.to_csv('CodeAlpha_Naukri_Cleaned_Dataset.csv')